{
  "name": "EVANS HONU",
  "title": "KWAME NKRUMAH UNIVERSITY OF SCIENCE AND TECHNOLOGY",
  "about": "Evans Honu holds a Bachelor of Science degree in Physics from the Kwame Nkrumah University of Science and Technology where under the guidance of Prof. Reuben Tamakloe, Dr. Michael Edem Donkor and Prof Sylvester Kojo Danuor, worked on designing custom circuit boards for a wide variety of applications particularly for seismic and analyzer devices. Evans has worked as a Research and Teaching Assistant teaching courses in Circuit theory, Electricity and Magnetism and Geometrical Optics and Waves. He has experience in analog and digital circuit design, STM32 and ESP32 microcontrollers, Altium and Kicad printed circuit board design software, fusion 360, raspberry pi, etc. He has had hands-on experience on frameworks like, ROS and High-Speed PCB, robotics platforms like ROS noetic. He also has experience in C++, python and the C programming languages. He is currently a freelance hardware design engineer consultant for 3Farmate Robotics Limited, where he develops control engines from scratch for their robots(www.3farmate.com).",
  "socialLinks": {
    "github": "https://github.com/Evanshonu",
    "linkedIn": "https://www.linkedin.com/in/evans-honu-04b0a716b"
  },
  "videos": [
    {
      "videoUrl": "https://www.youtube.com/embed/1SJPDaMBAi0",
      "title": "FAMA robot(Agricultural Robot)",
      "summary":"An autonomous AI powered solar robot for seed planting and fertilizer application without any human intervention. Features 1. GPS Autonomous Outdoor Navigation 2. Up to 6hrs continuous work time 3. web interface for remote control and more. I designed the engine for the robot, The robot digs the ground and then plants the seed and also cover the soil. I was very happy to be a part of the team and leading the hardware design."
    }
  ],
  "projects": [
    {
      "summary": "As part of the project (Nitrogen Plant) the students needed an oxygen analyzer, helps ensure that the nitrogen gas from the nitrogen plant has a very low level of oxygen. I develop an oxygen analyzer and programmed it. My device can measure oxygen concentration from 21- 900 ppm which can be compared to the commercially available ones. There is a buzzer and an organic led screen that display and alert the user a threshold concentration set in code. Below is a picture of the device I designed.",
      "title": "OXYGEN Analyzer for Nitrogen Plant",
      "containsMore":true
    },
    {
      "summary": "I designed a custom circuit board for biomedical students working on nitrogen plant. My board is responsible for the opening and close of a solenoid gas valve for the passage of nitrogen gas. The hardware was program from scratch using C and C++. Solenoid gas valve operate by translating electrical signals received from a microcontroller to open or close a valve. This then controls the flow of gas through the circuit, which in turn enhances the functionality of the Nitrogen plant. The was selected among best exhibited project.",
      "title": "SOLENOID Gas Valve Controller Board."
    },
    {
      "summary": "We are currently at eastern region (Ghana) were we are running pilot programs on our autonomous robot prototype for seed planting and spraying, and the progress so far has been great!!!!!!!!. All the hardware sections was handled by me. The robot’s autonomy is fully powered by ROS(Robot Operating System).",
      "title": "We are running pilot programs on the FAMA robot"
    },
    {
      "summary":"The four stepper four servo control board was my first board I designed without troubleshooting. I am so elated to announce it. Immediately I supplied power to the board, the system turns ON by pressing the ON/OFF button. The heart of it is an Arduino Mega microcontroller board. The board works when a HIGH is sent to a D flip-flop which interns trigger a relay and switches the entire system ON. Specifications:Max input voltage – 12VDrives 4 servos – 6V ( Has onboard voltage regulator ).Drives 4 steppers- 12V. Files needed for the fabrication can be found here. ( https://github.com/Evanshonu )",
      "title":"Stepper and Servo  Control Board."
    }
  ]
}
